import string
from nltk.tokenize import word_tokenize
from sklearn.metrics.pairwise import cosine_similarity
from sklearn.feature_extraction.text import CountVectorizer
from nltk.corpus import stopwords
import numpy as np
similarity1 = 0
sentence = []
grade = []
t = []
grade1 = 0
ask_me_question = input(" چکاري ميتوانم برايتان انجام دهم ؟ " )
def similarity(ask_me_question , sentence ):
    global grade,grade1
    sentencess = []
    #stopwords = ['[','[',['کجاست'],['است'],['کيست'],['دارد']]
    sentencess.append(ask_me_question)
    sentencess.append(sentence)
    #def clean_string(text):
        #text = ''.join([word for word in text if word not in string.punctuation])
        #text = text.lower()
        #text = ' '.join([word for word in text.split() if word not in stopwords])
        #return text
    #cleaned = list(map(clean_string,sentencess))
    #print(cleaned)
    vectorizer = CountVectorizer().fit_transform(sentencess)
    vectors = vectorizer.toarray()
    csim = cosine_similarity(vectors)
    def cosine_sim_vectors(vec1,vec2):
        vec1 = vec1.reshape(1 , -1)
        vec2 = vec2.reshape(1 , -1)
        return cosine_similarity(vec1,vec2)[0][0]
    similarity1 = cosine_sim_vectors(vectors[0],vectors[1])
    grade.append(similarity1)
    return grade
    
q = []

#ask_me_question = list(ask_me_question)

q2= [['دانشکده چند سالشه؟'],['سال تاسیس دانشگاه رو بگویید'],['تاریخ ساخت دانشگاه رو بگو'],['چه سالی دانشکده رو ساختند؟'],['کی دانشکده رو ساختند؟']]
q.append(q2)
q6=[['بانک این حوالی؟'],['در این حوالی بانک هست؟'],['بانک نزدیک به اینجا چقدر فاصله دارد؟'],['فاصله نزدیک ترین بانک تا ابنجا چقدر است؟'],['کجا می توانم نزدیک ترین بانک را بیابم؟']]
q.append(q6)
q11= [['آزمایشگاه پردازش تصویر کجای این ساختمان است؟'],['آزمایشگاه پردازش تصویر کدام طبقه است؟'],['چطور آزمایشگاه پردازش تصویر را پیدا کنم؟'],['کجا تصاویر را پردازش می کنند؟'],['در چه مکانی تصاویر را می پردازند؟']]
q.append(q11)
q12= [['رییس دانشکده چه کسی است؟'],['کی رییس دانشکده است؟'],['چه کسی ریاست دانشکده را بر عهده دارد؟'],['ریاست دانشکده بر عهده کیست؟'],['ریاست محترم ددانشکده کیست؟']]
q.append(q12)
q13= [['میشه لطفا بفرمایید امروز غذا چیست؟'],['ببخشید غذا امروز دانشگاه چیه؟'],['غذر می خوام ناهار چیه؟'],['ببخشید ناهار چیه؟'],['ببخشید ممکنه بفرمایید امروز غذا چیه؟؟']]
q.append(q13)
q14= [['میشه لطفا بفرمایید دستشویی کجاس؟'],['ببخشید توالت کجاس؟'],['ببخشید دستشویی تو این طبقه هس؟']]
q.append(q14)
q26= [['دبیرخانه کجاست؟']]
q.append(q26)
q27= [['آموزش کجاست؟'],['برای سوالات آموزشی کجا باید برم؟']]
q.append(q27)
q36= [['اينجا رييس كيه؟'],['رييس دانشكده كيه؟'],['رييس دانشكده كامپيوتر كيست؟'],['چه كسي رياست دانشكده را برعهده دارد؟'],['رئيس؟']]
q.append(q36)
q43= [['دانشکده ی هوشمند کدام است؟'],['این دانشکده توانایی هوشمند شدن را دارد؟ '],['ما توانایی ساخت دانشکده ی هوشمند را داریم؟'],['دانشکده ی هوشمند چگونه پایه گذاری میشود؟'],['کسی توانایی پایه گذاری دانشکده ی هوشمند را دارد؟']]
q.append(q43)
q44= [['آدرس سایت دانشکده کجاست؟'],['چطوری سایت دانشکده رو پیدا کنم؟'],['سایت دانشکده تو کدام طبقه قرار دارد؟']]
q.append(q44)
q46= [['کتابخانه دانشکده در کدام طبقه قرار دارد؟'],['کتابخانه را چطوری پیدا کنم؟'],['کتابخانه کجاست؟'],['چطوری برم کتابخانه؟']]
q.append(q46)
q48= [['رئیس دانشکده در کدام اتاقه؟'],['شماره اتاق رئیس دانشکده چنده؟'],['کجا میتونم رئیس دانشکده را ببینم؟']]
q.append(q48)
q49= [['کجا می تونم از جزوه ام کپی بگیرم تو دانشکده؟'],['کجا می تونم از جزوه ام کپی بگیرم تو دانشکده؟']]
q.append(q49)
q50= [['کجا می توانم آمفی تئاتر دانشکده را پیدا کنم؟'],['آمفی تئاتر دانشکده کدوم طبقه است؟'],['آیا دانشکده آمفی تئاتر دارد ؟ اگر دارد کجاست؟'],['آمفی تئاتر کجاست آخه؟'],['میشه بگید آمفی تئاتر کجاس؟']]
q.append(q50)
q51=[['تاریخ حذف اضطراری کی است؟'],['کی باید حذف اضطراری انحام دهیم؟'],['مهلت انحام حذف اضطراری تا کی است؟'],['تا چه زمانی می توانم درسم را حذف کنم؟'],['تا چه زمانی می توانم حذف اضطراری انجام دهم؟']]
q.append(q51)
q52= [['دانشگاه سلفش کجاست؟'],['غذاخوری دانشگاه کجاست؟']]
q.append(q52)
q1 = [['کپی و پرینتی کجاست'],['کجا میتونم کپی بگیرم'],['فوتوکپی کجاست'],['پرینت کجا میگیرند']]
q.append(q1)
q53= [['دفتر معاون آموزشی در کدام طبقه قرار دارد؟'],['دفتر معاون آموزشی کجاست؟'],['معاون آموزشی دانشکده را کجا می توانم پیدا کنم؟']]
q.append(q53)
q55= [['آموزش دانشکده در کدام طبقه قرار دارد؟'],['دفتر آموزش کجاست؟'],['مسئول آموزش دانشکده را کجا می توانم پیدا کنم؟']]
q.append(q55)
q58= [['میخواهم از پرینتر سایت استفاده کنم. چه کنم؟'],['چگونه میتوان از پرینتر سایت استفاده کرد؟'],['نحوه ی استفاده از پرینتر سایت چگونه است؟']]
q.append(q58)
q59= [['آیا دانشکده ی کامپیوتر کتابخانه دارد؟'],['دانشکده ی کامپیوتر کتابخانه دارد؟']]
q.append(q59)
q61= [['کجا میشه غذام رو   گرم کنم؟'],['آبدارخانه امکان گرم غذا داره؟'],['دانشگده ماکروفر داره؟ کجا؟'],['میخوام غذام رو گرم کنم. کجا برم؟'],['کسی. میدونه آبدارخانه گرم کن غذا داره؟']]
q.append(q61)
q62=[['کجا ميشه نماز خوند']]
q.append(q62)
answer = [ ['دانشکده سال 1355 تاسیس شده'] , 
          ['بانک تجارت جنب درب جنوبی دانشگاه است'],
           
          ['طبقه دوم'] , ['دکتر شمس فرد'] , ['برای پاسخ به این سوال به رستوران مراجعه کنید'],
          ['انتهای راهرو سمت چپ'] ,  
          
          
          ['دبیرخانه دانشکده، طبقه سوم، روبه روی راهروی کتابخانه.'] , ['آموزش دانشکده، طبقه اول، سمت راست درب خروج دانشکده قرار دارد.'], 
          ['خانم دكتر شمس فرد'] , 
          
          ['با هوشمندی میتوانیم دانشکده هوشمند بسازیم'],
          ['سایت دانشکده، در طبقه سوم قرار دارد.'] ,  ['کتابخانه دانشکده، در طبقه سوم دانشکده قرار دارد.'],
          
          ['طبقه سوم دست چپ'] , ['زیراکس   زیرزمین دانشکده هست'] , ['زیرزمین دانشکده است'],
          ['معمولا تاریخ حذف اضطراری تا میانه ترم است.'] ,['طبقه منفی یک کنار لابی'] , ['در دندانپزشکی رو به سمت داخل دانشگاه بروید'] , ['دفتر معاون آموزشی دانشکده در طبقه چهارم است.'],
          ['آموزش دانشکده در طبقه همکف است.'] ,
          ['برای استفاده از پرینتر سایت دانشکده ابتدا باید به آموزش دانشکده مراجعه کنید و با پرداخت شارژ ثبت نام نمایید.'] ,
          ['دانشکده ی کامپیوتر کتابخانه ندارد.'],['طبقه دوم آبدارخانه ماکروفر دارد'],
          ['زیرزمین']]

for count in range(len(q)):
    t = q[count]
    for i in range(len(t)):
        sentence = str(t[i])
        similarity(ask_me_question,sentence)
    print(grade)
    win = max(grade)
    if win > 0.20 :
            stopwords = ['[','[','"']
            def clean_string(text):
                text = ''.join([word for word in text if word not in string.punctuation])
                text = text.lower()
                text = ' '.join([word for word in text.split() if word not in stopwords])
                return text
            cleaned = list(map(clean_string,answer[count]))
            print(cleaned)
            break
    else:
        win = 0
        grade=[]
        sentence = []
        continue
               


q22= [['کجا میتونم دکتر حقیقی رو پیدا کنم؟'],['اتاق دکتر حقیقی در کدام طبقه قرار دارد؟'],['اتاق استاد حقیقی کدام طبقه است؟'],['چجوری میتونم دکتر حقیقی رو پیدا کنم؟'],['کجا میتونم دکتر حقیقی رو ملاقات کنم؟']]
q.append(q22)
['اتاق دکتر حقیقی، طبقه 4 وسط راهرو']     

q23= [['فعالیت دکتر حقیقی در چه موضوعاتی است؟'],['دکتر حقیقی در چه موضوعاتی کار کرده است؟'],['حوزه ی فعالیت دکتر حقیقی چیست؟'],['موضوعات کاری دکتر حقیقی؟']]
q.append(q23)
['دکتر حقیقی در حوزه ی تست نرم افزار وتوصیف صوری و ... فعالیت دارند']

q25= [['کجا میتونم دکتر شمس رو پیدا کنم؟'],['اتاق دکتر شمس در کدام طبقه قرار دارد؟'],['اتاق استاد شمس کدام طبقه است؟'],['چجوری میتونم دکتر شمس رو پیدا کنم؟'],['کجا میتونم دکتر شمس رو ملاقات کنم؟']]
q.append(q25)
['اتاق دکتر شمس، طبقه 4 انتهای راهرو'],

q28= [['فعالیت دکتر طباطبایی در چه موضوعاتی است؟'],['دکتر طباطبایی در چه موضوعاتی کار کرده است؟'],['حوزه ی فعالیت دکتر طباطبایی چیست؟'],['موضوعات کاری دکتر طباطبایی؟']]
q.append(q28)

['دکتر طباطبایی در حوزه ی پرازش فراگیر و سوشیال سنسینگ و ... فعالیت دارند']

q29= [['کجا میتونم دکترناوی رو پیدا کنم؟'],['اتاق دکتر ناوی در کدام طبقه قرار دارد؟'],['اتاق استاد ناوی کدام طبقه است؟'],['چجوری میتونم دکتر ناوی رو پیدا کنم؟'],['کجا میتونم دکتر ناوی رو ملاقات کنم؟']]
q.append(q29)
['اتاق دکتر ناوی، طبقه 4 انتهای راهرو'] ,

q30= [['فعالیت دکتر شمس فرد در چه موضوعاتی است؟'],['دکتر شمس فرد در چه موضوعاتی کار کرده است؟'],['حوزه ی فعالیت دکتر شمس فرد چیست؟'],['موضوعات کاری دکتر شمس فرد؟']]
q.append(q30)

['دکتر شمس فرد در حوزه ی پرازش زبان فارسی NLP و ... فعالیت دارند'] 

q31= [['فعالیت دکتر ابراهیمی مقدم در چه موضوعاتی است؟'],['دکتر ابراهیمی مقدم در چه موضوعاتی کار کرده است؟'],['حوزه ی فعالیت دکتر ابراهیمی مقدم چیست؟'],['موضوعات کاری دکتر ابراهیمی مقدم؟'],['']]
q.append(q31)
['دکتر ابراهیمی در حوزه ی پرازش تصاویر و سیستم عامل فعالیت دارند'],


q32= [['کجا میتونم دکتر شمس فرد رو پیدا کنم؟'],['اتاق دکتر شمس فرد در کدام طبقه قرار دارد؟'],['اتاق استاد شمس فرد کدام طبقه است؟'],['چجوری میتونم دکتر شمس فرد رو پیدا کنم؟'],['کجا میتونم دکتر شمس فرد رو ملاقات کنم؟']]
q.append(q32)


['اتاق دکتر شمس فرد، طبقه 3 انتهای راهرو، اتاق مدیر دانشکده']

q33= [['کجا میتونم دکتر نشاطی رو پیدا کنم؟'],['اتاق دکتر نشاطی در کدام طبقه قرار دارد؟'],['اتاق استاد نشاطی کدام طبقه است؟'],['چجوری میتونم دکتر نشاطی رو پیدا کنم؟'],['کجا میتونم دکتر نشاطی رو ملاقات کنم؟']]
q.append(q33)

['اتاق دکتر نشاطی، طبقه 4 انتهای راهرو']


q34= [['کجا میتونم دکتر وحیدی رو پیدا کنم؟'],['اتاق دکتر وحیدی در کدام طبقه قرار دارد؟'],['اتاق استاد وحیدی کدام طبقه است؟'],['چجوری میتونم دکتر وحیدی رو پیدا کنم؟'],['کجا میتونم دکتر وحیدی رو ملاقات کنم؟']]
q.append(q34)

['اتاق دکتر وحیدی، طبقه 4 انتهای راهرو'],

q35= [['کجا میتونم دکتر طباطبایی رو پیدا کنم؟'],['اتاق دکتر طباطبایی در کدام طبقه قرار دارد؟'],['اتاق استاد طباطبایی کدام طبقه است؟'],['چجوری میتونم دکتر طباطبایی رو پیدا کنم؟'],['کجا میتونم دکتر طباطبایی رو ملاقات کنم؟']]
q.append(q35)
['اتاق دکتر طباطبایی، طبقه 4 انتهای راهرو']


q37= [['اقاي دكتر ناظمي را كجا ميتوانم پيدا كنم؟'],['ممكن است لطفا بفرماييد كجا ميتوانم جناب اقاي دكتر ناظمي را ملاقات نمايم؟'],['محل فعلي اقاي ناظمي چيست؟'],['دكتر ناظمي كو؟'],['ميخوام دكتر ناظمي رو ببينم']]
q.append(q37)

['اتاق اقاي دكتر ناظمي در طبقه ٤. اتاق ٤١٥ است'],

q54= [['دفتر دکتر شمسفرد کجاست'],['اتاق رئیس دانشکده طبقه چندم است'],['اتاق دکتر شمس فرد کدام طبقه است'],['شماره اتاق دکتر شمس فرد چند است و کدام طبقه است؟'],['خانم دکتر اتاقشان کدام طبقه است؟']]
q.append(q54)
['طبقه سوم'] ,
q60= [['چه استادی در دانشکده در حوزه ی شبکه های عصبی کار میکند؟'],['برای کار در زمینه ی شبکه های عصبی به کدام استاد مراجعه کنم؟'],['در زمینه ی شبکه های عصبی کدام استاد تجربه دارد؟'],['شبکه های عصبی فیلد تخصصی کدام استاد در دانشکده است؟'],['از میان استادان دانشکده کدامیک در فیلد شبکه های عصبی کار کرده است؟']]
q.append(q60)
['یکی از فیلدهای تخصصی در آزمایشگاه دکتر صفابخش شبکه های عصبی است'],









q4=[['محل تشکیل کلاس هوش کجاست؟'],['کلاس هوش در چه مکانی تشکیل می شود؟'],['محل برگزاری کلاس هوش ؟'],['درس هوش کجا تدریس می شود؟'],['کلاس هوش کو؟']]
q.append(q4)
['اتاق 105'] ,
q5=[['محل برگزاری مسابقات ای سی ام کجاست؟'],['کجا می توانم در مسابقه ای سی ام شرکت کنم؟'],['کجا می توانم در مسابقه  ACMشرکت کنم؟'],['محل برگزاری مسابقات ACM کجاست؟'],['مسابقه ACM کجا برزار می شود؟']]
q.append(q5)
['برای پاسخ به این سوال به سایت مراجعه کنید']

q7=[['مهلت تحویل پروژه تا کی است؟'],['تا کی می توانم پروژه تحویل دهم؟'],['آخرین زمانی که می توانم پروژه ام را تحویل دهم کی است؟'],['آخرین فرصت تحویل پروژه؟'],['مهلت تحویل پروژه ها از چه تاریخی تا چه تاریخی است؟']]
q.append(q7)
['از استادتان بپرسید!']
q3=[['نمرات چه زمانی  در سایت وارد می شوند؟'],['کی نمرات می رن رو سایت؟'],['نمراترا چه زمانی می توان از روی سایت مشاهده کرد؟'],['نمرات کی روی سایت قرار خواهند گرفت؟'],['زمان قرار گیری نمرات روی سایت؟']]
q.append(q3)
['از استادتان بپرسید!'],
q10= [['چه کسی الگوریتم تتدریس می کند؟'],['مدرس الگوریتم کدام استاد است؟'],['کدام استاد مدرس الگوریتم است؟'],['تدریس درس الگوریتم بر عهده چه کسی است؟'],['کدامیک از اساتید دانشکده تدریس الگوریتم را بر عهده دارد؟']]
q.append(q10)
['دکتر قوامی زاده'],
q15= [['درس سیستم عامل پیشرفته کی تشکیل می شود؟'],['کلاس سیستم عامل پیشرفته چه زمانی برگزار میشود؟']]
q.append(q15)
['سیستم عامل پیشرفته، در روزهای یکشنبه و سه شنبه ساعت 9 الی 10:30 (فرضا) تشکیل میشود'] ,


q16= [['محل برگذاری درس سیستم عامل پیشرفته کجاست؟'],['کلاس سیستم عامل پیشرفته کجاست؟']]
q.append(q16)
['درس سیستم عامل پیشرفته در کلاس 114 (فرضا) تشکیل می شود'],

q17= [['درس پایگاه داده پیشرفته کی تشکیل می شود؟'],['کلاس پایگاه داده پیشرفته چه زمانی برگزار میشود؟']]
q.append(q17)
['پایگاه داده پیشرفته، در روزهای یکشنبه و سه شنبه ساعت 15 الی 17 (فرضا) تشکیل میشود'] , 
q18=[['محل برگذاری درس پایگاه داده پیشرفته کجاست؟'],['کلاس پایگاه داده پیشرفته کجاست؟']]
q.append(q18)
['درس پایگاه داده پیشرفته در کلاس 116 (فرضا) تشکیل می شود'] ,











q9= [['امتحانات ترم کی شروع می شوند؟'],['امتحانات از کی تا کی ان؟'],['تاریخ آغاز امتحانات چندم است؟'],['زمان شروع امتحانات کی است؟'],['تاریخ امتحانات ترم؟']]
q.append(q9)
['11 دی'],

q19= [['چجوری میتوانم یک ترم به دلیل بیماری مرخصی بگیرم؟'],['آیا میتوانم مرخصی پزشکی برای یک ترم بگیرم؟']]
q.append(q1)
['نمایش شرایط و مراحل گرفتن مرخصی پزشکی در ترم طبق قوانین دانشکده'],
q20= [['کی باید برای حذف اضطراری کنم؟'],['تاریخ حذف اضطراری؟'],['زمان انجام حذف اضطراری؟'],['تاریخ شروع انتخاب واحد کی است؟']]
q.append(q20)
['نمایش تاریخ حذف اضطراری آن ترم، مثلا 95/10/28'] 
q21= [['کی باید انتخاب واحد کنم؟'],['تاریخ انتخاب واحد؟'],['زمان انجام انتخاب واحد؟'],['تاریخ شروع انتخاب واحد کی است؟']]
q.append(q21)
['نمایش تاریخ شروع انتخاب واحد همان ترم، مثلا 95/10/20'] ,
q39= [['تازيخ شروع امتحانات چيست؟'],['شروع امتحانات از چه زمان است؟'],['چه موقع امتحانات پايان ترم آغاز ميشوند؟'],['زمان شروع  پايان ترمها ؟'],['از چه تاريخي امتحاناي اخر ترم شروع ميشن؟']]
q.append(q39)
['١١ دي'] 
q42= [['کی تاریخ انتخاب واحد ترم بهمن هست؟'],['ترم دوم انتخاب واحد کی شروع میشه؟'],['چه زمانی انتخاب واحد ترم دوم هستش؟'],['تاریخ انتخاب واحد ترم دوم از چندم هست؟'],['زمان انتخاب واحد بهمن ماه کی هستش؟']]
q.append(q42)
['انتخاب واحد ترم دوم از دوم بهمن شروع می شود'] ,
q38= [['اخرين روز كلاسها؟'],['پايان كلاساي  اين ترم چه روزيه؟'],['كلاسهاي اين نيمسال چه موقع تمام ميشوند؟'],['اخرين تاريخ برگزاري كلاس در ترم جاري كدامست؟'],['تا كي بايد سر كلاس بريم؟!']]
q.append(q38)
['پايان كلاسها در ترم جاري ٨  ديماه است'] ,
q47= [['چند واحد کار دانشجویی باید توسط هر دانشجوی ارشد انجام گیرد؟']]
q.append(q47)
['هر دانشجوی ارشد باید 4 واحد کار دانشجویی را در طول مدت تحصیل خود انجام دهد.'] ,
q57=[['به چه کسی باید فرم موضوع پایان نامه را تحویل داد'],['فرم موضوع پایان نامه را کجا بدهم']]
q.append(q57)
['به خانم زندی طبقه سوم'] , 
q56= [['چگونه مرخصی بگیریم؟'],['برای گرفتن مرخصی باید چکار کنیم؟'],['برای گرفتن مرخصی چه مراحلی باید طی شود؟'],['فرآیند ثبت مرخصی تحصیلی چگونه است؟']]
q.append(q56)
['باید به سیستم گلستان مراجعه و درخواست خود را ثبت نمایید. سپس از دانشکده پیگیریکنید'],

q45= [['زمان و مکان کلاس ایمیج کارشناسیا چنده؟'],['چه ساعتی و کجا دانشجوهای کارشناسی کلاس تحلیل تصاویر دیجیتالی دارن؟'],['من دانشجوی کارشناسیم و میخاستم بدونم زمان برگزاری کلاس تجزیه و تحلیل عکسها به صورت دیجیتالی چه روزاییه و کدوم کلاسه؟و په ساعتی؟'],['ممنون میشم بگی کلاس پروسس پیکچرها با  استادم  کدومه و از چند تا چنده؟'],['می تونی کمکم کنی کلاسمو که با دکتر طالب پور دارم پیدا کنم ؟']]
q.append(q45)
['یکشنبه و سه شنبه ها ساعت 10 صبح کلاس 109'] ,
q40= [['آزمایشگاه های دروس هوش کجا هستند؟'],['آزمایشگاه nlp و image کجان؟'],['ان ال پی و ایمیج آزمایشگاهاشون کجای دانشکدس؟'],['مکان ازمایشگاه های هوش رو میخوام'],['طبقه چندم دانشکده اختصاص داره به ان ال پی و ایمیج؟']]
q.append(q40)
['طبقه دوم دانشکده'],








