import string
from nltk.tokenize import word_tokenize
from sklearn.metrics.pairwise import cosine_similarity
from sklearn.feature_extraction.text import CountVectorizer
from nltk.corpus import stopwords
import numpy as np


q = []

q1 = [ 'کجا ميتونم کپي بگيرم؟' , 'پرينت کجا ميگيرند؟' , 'کپي کجا ميگيرند' , 'کپي و پرينتي کجاست؟' ]
q.append(q1)
q2= ['دانشکده چند سالشه؟','سال تاسيس دانشکده را بگوييد','تاريخ ساخت دانشکده رو بگو','چه سالي دانشکده رو ساختند','کي دانشکده رو ساختند؟']
q.append(q2)
q3=['بانک اين حوالي؟','در اين حوالي بانک هست؟','بانک نزديک به اينجا چقدر فاصله دارد؟','فاصله ي نزديکترين بانک تا اينجا چقدر است؟','کجا ميتوانم نزديکترين بانک را بيابم؟']
q.append(q3)
q4= ['ازمايشگاه پردازش تصوير کجاي اين ساختمان است؟','ازمايشگا پردازش تصوير کدام طبقه است؟','چطور ازمايشگاه پردازش تصوير رو پيدا کنم؟','کجا تصاوير رو پردازش مي کنند؟','در چه مکاني تصاوير را مي پردازند؟']
q.append(q4)
q5= ['رييس دانشکده چه کسي است؟','کي رييس دانشکده است؟','چه کسي رياست دانشکده را برعهده دارد؟','رياست دانشکده برعهده ي کيست؟','رياست محترم دانشکده کيست؟']
q.append(q5)
q6= ['ميشه لطفا بفرماييد امروز غذا چيست؟','ببخشيد غذاي امروز چيه؟','عذر ميخوام ناهار چيه؟','ببخشيد ناهار چيه؟','ببخشيد ممکنه بفرماييد امروز غذا چيه؟']
q.append(q6)
q7= ['ميشه لطفا بفرماييد دستشويي کجاس؟','ببخشيد توالت کجاس؟','ببخشيد دستشويي تو اين طبقه هس؟']
q.append(q7)
q8= ['دبيرخانه کجاست؟']
q.append(q8)
q9= ['آموزش کجاست؟','براي سوالات اموزشي کجا بايد برم؟']
q.append(q9)
q10= ['اينجا رييس کيه؟','رييس دانشکده کيه؟','رييس دانشکده ي کامپيوتر کيست؟','چه کسي رياست دانشکده را بر عهده دارد؟','رييس؟']
q.append(q10)
q11= ['دانشکده ي هوشمند کدام است؟','اين دانشکده توانايي هوشمند شدن را دارد؟','ما توانايي ساخت دانشکده ي هوشمند را داريم؟','دانشکده ي هوشمند چگونه بايد پايه گذاري شود؟','کسي توانايي پايه گذاري دانشکده ي هوشمند را دارد؟']
q.append(q11)
q12= ['ادرس سايت دانشکده کجاست؟','چطوري سايت دانشکده رو پيدا کنم؟','سايت دانشکده تو کدوم طبقه قرار دارد؟']
q.append(q12)
q13= ['کتابخانه ي دانشکده در کدام طبقه قرار دارد؟','کتابخانه رو چطوري پيدا کنم؟','کتابخانه کجاست؟','چطوري برم کتابخانه؟']
q.append(q13)
q14= ['رييس دانشکده در کدوم اتاقه؟','شماره ي اتاق رييس دانشکده چنده؟','کجا ميتونم رييس دانشکده رو ببينم؟']
q.append(q14)
q15= ['کجا ميتونم از جزوه ام کپي بگيرم تودانشگاه؟','کجا ميتونم از جزوه ام کپي بگيرم تو دانشکده؟']
q.append(q15)
q16= ['کجا ميتوانم امفي تئاتر دانشکده را پيدا کنم؟','آمفي تئاتر دانشکده کدوم طبقه است؟','آيا دانشکده آمفي تئاتر دارد؟اگر دارد کجاست؟','آمفي تئاتر کجاست آخه؟','ميشه بگيد آمفي تئاتر کجاس؟']
q.append(q16)
q17=['تاريخ حذف اضطراري کي است؟','کي بايد حذف اضطراري انجام دهيم؟','مهلت انجام حذف اضطراري تا کي ايت؟','تا چه زماني ميتوانم درسم را حذف کنم؟','تا چه زماني ميتوانم حذف اضطراري انجام دهم؟']
q.append(q17)
q18= ['دانشگاه سلفش کجاس؟','غذاخوري دانشگاه کجاست؟']
q.append(q18)
q20= ['دفتر معاون اموزشي در کدام طبقه قرار دارد؟','دفتر معاون اموزشي کجاست؟','معاون اموزشي دانشگاه رو کجا ميتونم پيدا کنم؟']
q.append(q20)
q21= ['اموزش دانشکده در کدام طبقه قرار دارد؟','دفتر اموزش کجاست؟','مسئول اموزش دانشکده را کجا ميتوانم پيدا کنم؟']
q.append(q21)
q22= ['ميخواهم از پرينتر سايت استفاده کنم ، چه کنم؟','چگونه ميتوان از پرينتر سايت استفاده کرد؟','نحوه ي استفاده از پرينتر سايت چگونه است؟']
q.append(q22)
q23= ['آيا دانشکده ي کامپيوتر کتابخانه دارد؟','دانشکده ي کامپيوتر کتابخانه دارد؟']
q.append(q23)
q24= ['کجا ميشه غذام رو گرم کنم؟','ابدارخانه امکان گرم غذا رو داره؟','دانشکده ماکروفر داره؟کجا؟','ميخوام غذام رو گرم کنم ، کجا برم؟','کسي ميدونه ابدارخانه گرمکن غذا داره؟']
q.append(q24)
q25=['کجا ميشه نماز خوند؟']
q.append(q25)
q26= ['کجا ميتونم دکتر حقيقي رو پيدا کنم؟','اتاق دکتر حقيقي در کدام طبقه قرار دارد؟','اتاق استاد حقيقي کدام طبقه است؟','چجوري ميتونم دکتر حقيقي رو پيدا کنم؟','کجا ميتونم دکتر حقيقي رو پيدا کنم؟']
q.append(q26)
q27= ['فعاليت دکتر حقيقي در چه موضوعاتي است؟','دکتر حقيقي در چه موضوعاتي کار کرده است؟','حوزه ي فعاليت دکتر حقيقي چيست؟','موضوعات کاري دکتر حقيقي؟']
q.append(q27)
q28= ['کجا ميتونم دکتر شمس رو پيدا کنم؟','اتاق دکتر شمس در کدام طبقه قرار دارد؟','اتاق استاد شمس کدام طبقه است؟','چجوري ميتونم دکتر شمس رو پيدا کنم؟','کجا ميتونم دکتر شمس رو ملاقات کنم؟']
q.append(q28)
q29= ['فعاليت دکتر طباطبايي در چه موضوعاتي است؟','دکتر طباطبايي در چه موضوعاتي کار کرده است؟','حوزه ي فعاليت دکتر طباطبايي چيست؟','موضوعات کاري دکتر طباطبايي؟']
q.append(q29)
q30= ['کجا ميتونم دکتر ناوي رو پيدا کنم؟','اتاق دکتر ناوي در کدام طبقه قرار دارد؟','اتاق استاد ناوي کدام طبقه است؟','چجوري ميتونم دکتر ناوي رو پيدا کنم؟','کجا ميتونم دکتر ناوي رو ملاقات کنم؟']
q.append(q30)
q31= ['فعاليت دکتر شمس فرد در چه موضوعاتي است؟','دکتر شمس فرد در چه موضوعاتي کار کرده است؟','حوزه ي فعاليت دکتر شمس فرد چيست؟','موضوعات کاري دکتر شمس فرد؟']
q.append(q31)
q32= ['فعاليت دکتر ابراهيمي مقدم در چه موضوعاتي است؟','دکتر ابراهيمي مقدم در چه موضوعاتي کار کرده است؟','حوزه ي فعاليت دکتر ابراهيمي مقدم چيست؟','موضوعات کاري دکتر ابراهيمي مقدم؟']
q.append(q32)
q33= ['کجا ميتونم دکتر شمس فرد رو پيدا کنم؟','اتاق دکتر شمس فرد در کدام طبقه است؟','اتاق استاد شمس فرد در کدام طبقه است؟','چجوري ميتونم دکتر شمس رو پيدا کنم؟','کجا ميتونم دکتر شمس فرد رو پيدا کنم؟']
q.append(q33)
q34= ['کجا ميتونم دکتر نشاطي رو پيدا کنم؟','اقاي دکتر نشاطي در کدام طبقه قرار دارد؟','اتاق استاد نشاطي کدوم طبقه است؟','چجوري ميتونم دکتر نشاطي رو پيدا کنم؟','کجا ميتونم دکتر نشاطي رو پيدا کنم؟']
q.append(q34)
q35= ['کجا ميتونم دکتر وحيدي رو پيدا کنم؟','اتاق دکتر وحيدي در کدام طبقه قرار دارد؟','اتاق استاد وحيدي کدام طبقه است؟','چجوري ميتونم دکتر وحيدي رو ملاقات کنم؟','کجا ميتونم دکتر وحيدي رو ملاقات کنم؟']
q.append(q35)
q36= ['کجا ميتونم دکتر طباطبايي رو پيدا کنم؟','اقاي دکتر طباطبايي در کدام طبقه قرار دارد؟','اتاق استاد طباطبايي کدام طبقه است؟','چجوري ميتونم دکتر طباطبايي رو ملاقات کنم؟','کجا ميتونم دکتر طباطبايي رو ملاقات کنم؟']
q.append(q36)
q37= ['اقاي دکتر ناظمي رو کجا ميتوانم پيدا کنم؟','ممکن است لطفا بفرماييد جناب اقاي دکتر ناظمي را ملاقات کنم؟','محل فعلي اقاي ناظمي چيست؟','دکتر ناظمي کو؟','ميخوام دکتر ناظمي رو ببينم']
q.append(q37)
q38= ['دفتر دکتر شمس فرد کجاست؟','اتاق دکتر شمس فرد کدام طبقه است؟','شماره ي اتاق دکتر شمس فرد چند است؟ کدام طبقه است؟','خانم دکتر اتاقشان کدام طبقه است؟']
q.append(q38)
q39= ['چه استادي در دانشکده در حوزه ي شبککه هاي عصبي کار ميکند؟','براي کار در زمينه ي شبکه هاي عصبي به کدام استاد مراجعه کنم؟','در زمينه ي شبکه هاي عصبي کدام استاد تجربه دارد؟','شبکه هاي عصبي فيلد تخصصي کدام استاد در دانشکده است؟','از ميان استادان دانشکده کدامشان در فيلد شبکه هاي عصبي کار کرده است؟']
q.append(q39)
q40=['محل تشکيل کلاس هوش کجاست؟','کلاس هوش در چه کلاسي برگذار ميشود؟','محل برگذاري کلاس هوش؟','درس هوش کجا تدريس ميشود؟','کلاس هوش کو؟']
q.append(q40)
q41=['محل برگذاري نسابقات اي سي ام کجاست؟','کجا ميتوانم در مسابقات اي سي ام شرکت کنم؟','کجا ميتوانم در مسابقات ACM شرکت کنم؟','محل برگذاري مسابقات ACM کجاست؟','مسابقه ي ACM کجا برگذار ميشود؟']
q.append(q41)
q42=['مهلت تحويل پروژه کي است؟','تا کي ميتوانم پروژه تحويل دهم؟','اخرين زماني که ميتوانم پروژه ام را تحويل دهم کي است؟','اخرين فرصت تحويل پروژه؟','مهلت تحويل پروژه ها از چه تاريخي تا چه تاريخي است؟']
q.append(q42)
q43=['نمرات چه زماني در سايت وارد ميشوند؟','کي نمرات رو ميذارن رو سايت؟','نمرات را از چه زماني ميتوان در سايت مشاهده کرد؟','نمرات روي سايت کي قرار خواهند گرفت؟','زمان قرارگيري نمرات روي سايت؟']
q.append(q43)
q44= ['چه کسي الگوريتم تدريس مي کند؟','مدرس الگوريتم کدام استاد است؟','کدام استاد مدرس الگريتم است؟','تدريش درس الگوريتم برعهده ي چه کسي است؟','کداميک از اساتيد دانشکده تدريس طراحي الگوريتم را برعهده دارد؟']
q.append(q44)
q45= ['درس سيستم عامل پيشرفته کي تشکيل مي شود؟','کلاس سيستم عامل پيشرفته چه زماني برگذار ميشود؟']
q.append(q45)
q46= ['محل برگذاري درس سيستم عامل پيشرفته کجاست؟','کلاس سيستم عامل يشرفته کجاست؟']
q.append(q46)
q47= ['درس پايگاه داده ي پيشرفته کي تشکيل مي شود؟','کلاس پايگاه داده پيشرفته کي برگذار مي شود؟']
q.append(q47)
q48=['محل برگذاري درس پايگاه داده پيشرفته کجاست؟','کلاس پايگاه داده پيشرفته کجاست؟']
q.append(q48)
q49= ['امتحانات ترم کي شروع مي شوند؟','امتحانات از کي تا کي ان؟','تاريخ اغاز امتحانات از چندم است؟','زمان شروع امتحانات از کي است؟','تاريخ امتحانات ترم؟']
q.append(q49)
q50= ['چجوري ميتونم يه ترم بدليل بيماري مرخصي بگيرم؟','ايا ميتوانم يک ترم مرخصي پزشکي بگيرم؟']
q.append(q50)
q51= ['کي بايد براي حذف اضطراري اقدام کنم؟','تاريخ حذف اضطراري؟','زمان انجام حذف اضطراري؟']
q.append(q51)
q52= ['کي بايد انتخاب واحد کنم؟','تاريخ انتخاب واحد؟','زمان انجام انتخاب واحد؟','تاريخ شروع انتخاب واحد؟']
q.append(q52)
q53= ['تاريخ شروع امتحانات چيست؟','شروع امتحانات از چه زماني است؟','چه موقع امتحانات پايان ترم اغاز ميشوند؟','از چه تاريخي امتحانات پايان ترم شروع ميشن؟']
q.append(q53)
q54= ['کي تاريخ انتخاب واحد ترم بهمن است؟','براي ترم دوم انتخاب واحد کي شروع ميشود؟','چه زماني انتخاب واحد ترم دوم هستش؟','تاريخ انتخاب واحد ترم دوم از چندم است؟','زمان انتخاب واحد بهمن ماه از کي است؟']
q.append(q54)
q55= ['اخرين روز کلاسها؟','پايان کلاسهاي اين ترم چه روزيه؟','کلاسهاي اين نيسمال کي تمام ميشوند؟','اخرين زمان برگذاري کلاسهاي ترم جاري کي است؟','تا کي بايد سر کلاس بريم؟']
q.append(q55)
q56= ['چند واحد کار دانشجويي بايد توسط هر دانشجوي ارشد انجام گيرد؟']
q.append(q56)
q57=['به چه کسي بايد فرم موضوع پايان نامه را تحويل داد؟','فرم موضوع پايان نامه را کجا بدهم؟']
q.append(q57)
q58= ['چگونه مرخصي بگيرم؟','براي گرفتن مرخصي بايد چکار کنيم؟','براي گرفتن مرخصي چه مراحلي بايد طي شود؟','فرايند ثبت مرخصي تحصيلي چگونه است؟']
q.append(q58)
q59= ['زمان و مکان کلاس ايميج کارشناسيا چنده؟','چه ساعتي و کجا بچه هاي کارشناسي کلاس تحليل تصاوير ديجيتالي دارند؟','من دانشجوي کارشناسيم و ميخواستم ببينم درس پروسس ايميجم کجاست؟','ممنون ميشم بهم بگي کلاس پروسس ايميجم کجا و از چند تا چنده؟','ميتوني کمکم کني کلاسي که با دکتر طالب پور دارمو پيدا کنم؟']
q.append(q59)
q60= ['ازمايشگاه هاي دروس هوش کجا هستند؟','ازمايشگاه image و nlp کجاست؟','ان ال اپي و ايميج ازمايشگاهاشون کجاي دانشکدس؟','مکان ازمايشگاه هاي هوش رو ميخوام','طبقه ي چندم دانشکده اختصاص داره به ان ال پي و ايميج؟']
q.append(q60)



answer = [ 'طبقه منفی یک کنار لابی' , 'دانشکده سال 1355 تاسیس شده' , 
          'بانک تجارت جنب درب جنوبی دانشگاه است',
          'طبقه دوم' , 'دکتر شمس فرد' , 'برای پاسخ به این سوال به رستوران مراجعه کنید',
          'انتهای راهرو سمت چپ' ,  
          'دبیرخانه دانشکده، طبقه سوم، روبه روی راهروی کتابخانه.' , 'آموزش دانشکده، طبقه اول، سمت راست درب خروج دانشکده قرار دارد.', 
          'خانم دكتر شمس فرد' , 
          'با هوشمندی میتوانیم دانشکده هوشمند بسازیم',
          'سایت دانشکده، در طبقه سوم قرار دارد.' ,  'کتابخانه دانشکده، در طبقه سوم دانشکده قرار دارد.',
          'طبقه سوم دست چپ' , 'زیراکس   زیرزمین دانشکده هست' , 'زیرزمین دانشکده است',
          'معمولا تاریخ حذف اضطراری تا میانه ترم است.' ,'در دندانپزشکی رو به سمت داخل دانشگاه بروید' , 'دفتر معاون آموزشی دانشکده در طبقه چهارم است.',
          'آموزش دانشکده در طبقه همکف است.' ,
          'برای استفاده از پرینتر سایت دانشکده ابتدا باید به آموزش دانشکده مراجعه کنید و با پرداخت شارژ ثبت نام نمایید.' ,
          'دانشکده ی کامپیوتر کتابخانه ندارد.','طبقه دوم آبدارخانه ماکروفر دارد',
          'زیرزمین','اتاق دکتر حقیقی، طبقه 4 وسط راهرو','دکتر حقیقی در حوزه ی تست نرم افزار وتوصیف صوری و ... فعالیت دارند',
          'اتاق دکتر شمس، طبقه 4 انتهای راهرو','دکتر طباطبایی در حوزه ی پرازش فراگیر و سوشیال سنسینگ و ... فعالیت دارند',
          'اتاق دکتر ناوی، طبقه 4 انتهای راهرو','دکتر شمس فرد در حوزه ی پرازش زبان فارسی NLP و ... فعالیت دارند' ,'دکتر ابراهیمی در حوزه ی پرازش تصاویر و سیستم عامل فعالیت دارند',
          'اتاق دکتر شمس فرد، طبقه 3 انتهای راهرو، اتاق مدیر دانشکده','اتاق دکتر نشاطی، طبقه 4 انتهای راهرو','اتاق دکتر وحیدی، طبقه 4 انتهای راهرو',
          'اتاق دکتر طباطبایی، طبقه 4 انتهای راهرو','اتاق اقاي دكتر ناظمي در طبقه ٤. اتاق ٤١٥ است','طبقه سوم','یکی از فیلدهای تخصصی در آزمایشگاه دکتر صفابخش شبکه های عصبی است',
          'اتاق 105','برای پاسخ به این سوال به سایت مراجعه کنید','از استادتان بپرسید!','از استادتان بپرسید!','دکتر قوامی زاده',
          'سیستم عامل پیشرفته، در روزهای یکشنبه و سه شنبه ساعت 9 الی 10:30 (فرضا) تشکیل میشود','درس سیستم عامل پیشرفته در کلاس 114 (فرضا) تشکیل می شود',
          'پایگاه داده پیشرفته، در روزهای یکشنبه و سه شنبه ساعت 15 الی 17 (فرضا) تشکیل میشود','درس پایگاه داده پیشرفته در کلاس 116 (فرضا) تشکیل می شود','11 دی',
          'نمایش شرایط و مراحل گرفتن مرخصی پزشکی در ترم طبق قوانین دانشکده','نمایش تاریخ حذف اضطراری آن ترم، مثلا 95/10/28','نمایش تاریخ شروع انتخاب واحد همان ترم، مثلا 95/10/20' ,
          '١١ دي','انتخاب واحد ترم دوم از دوم بهمن شروع می شود','پايان كلاسها در ترم جاري ٨  ديماه است','هر دانشجوی ارشد باید 4 واحد کار دانشجویی را در طول مدت تحصیل خود انجام دهد.',
          'به خانم زندی طبقه سوم','باید به سیستم گلستان مراجعه و درخواست خود را ثبت نمایید. سپس از دانشکده پیگیریکنید','یکشنبه و سه شنبه ها ساعت 10 صبح کلاس 109',
          'طبقه دوم دانشکده']







  


grade = []
win = 0

Document1 = input("سوالتون چيست؟")

def ask_me():
    global Document1
    for count in range(len(q)):
        for i in range(len(q[count])):
            text1 =q[count]
            Document2 = text1[i]
            #print(Document2)
            corpus = [Document1,Document2]
            count_vect = CountVectorizer()
            X_train_counts = count_vect.fit_transform(corpus)
            from sklearn.feature_extraction.text import TfidfVectorizer
            vectorizer = TfidfVectorizer()
            trsfm=vectorizer.fit_transform(corpus)
            from sklearn.metrics.pairwise import cosine_similarity
            sim = cosine_similarity(trsfm[0:1],trsfm)
            sim1 = float(min(sim[0]))
            #print(sim1)
            grade.append(sim1)
        win = max(grade)
        if win >= 0.9 :
            print(answer[count])
            break
        else:
            sim1 = 0
            sim = 0
            continue

ask_me()
while(10):
    ask_me_q = int(input('سوالي هست که بخواين بپرسين؟ [1(بله) يا 2(خير)]'))
    if ask_me_q == 1 :
        Document1 = input("سوالتون چيست؟")
        count = 0
        win = 0
        grade = []
        ask_me()
    else:
        print('خداحافظ')
        break







        
        
